# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
x = int(input('ВВедите число: '))
i = 0
z = 0

while x != 0:
    i = (i*10)+(x % 2)
    if i == 0:
        z += 1
    x = x//2

x = i
i = 0

while x > 0:
    i = (i*10) + (x % 10)
    x = x//10

while z != 0:
    i = i * 10
    z -= 1

print(i)
